apache/nuttx/arch/arm/src/common/stm32/stm32_otghsdev_m3m4_v1.c
  /* Check for session end detected */

  regval = stm32_getreg(STM32_OTGHS_GOTGINT);
  if ((regval & OTGHS_GOTGINT_SEDET) != 0)
    {
#warning "Missing logic"
    }

  /* Clear OTG interrupt */

  stm32_putreg(retval, STM32_OTGHS_GOTGINT);
}
#endif

/****************************************************************************
 * Name: stm32_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int stm32_usbinterrupt(int irq, void *context, void *arg)
{
  /* At present, there is only a single OTG HS device support. Hence it is
   * pre-allocated as g_otghsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct stm32_usbdev_s *priv = &g_otghsdev;
  uint32_t regval;

  usbtrace(TRACE_INTENTRY(STM32_TRACEINTID_USB), 0);

  /* Assure that we are in device mode */

  DEBUGASSERT((stm32_getreg(STM32_OTGHS_GINTSTS) & OTGHS_GINTSTS_CMOD)
    == OTGHS_GINTSTS_DEVMODE);

  /* Get the state of all enabled interrupts.  We will do this repeatedly
   * some interrupts (like RXFLVL) will generate additional interrupting
   * events.
   */

  for (; ; )
    {
      /* Get the set of pending, un-masked interrupts */

      regval  = stm32_getreg(STM32_OTGHS_GINTSTS);
      regval &= stm32_getreg(STM32_OTGHS_GINTMSK);

      /* Break out of the loop when there are no further pending (and
       * unmasked) interrupts to be processes.
       */

      if (regval == 0)
        {
          break;
        }

      usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_INTPENDING),
               (uint16_t)regval);

      /* OUT endpoint interrupt. The core sets this bit to indicate that an
       * interrupt is pending on one of the OUT endpoints of the core.
       */

      if ((regval & OTGHS_GINT_OEP) != 0)
        {
          usbtrace(
            TRACE_INTDECODE(STM32_TRACEINTID_EPOUT), (uint16_t)regval);
          stm32_epout_interrupt(priv);
          stm32_putreg(OTGHS_GINT_OEP, STM32_OTGHS_GINTSTS);
        }

      /* IN endpoint interrupt.  The core sets this bit to indicate that
       * an interrupt is pending on one of the IN endpoints of the core.
       */

      if ((regval & OTGHS_GINT_IEP) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_EPIN), (uint16_t)regval);
          stm32_epin_interrupt(priv);
          stm32_putreg(OTGHS_GINT_IEP, STM32_OTGHS_GINTSTS);
        }

      /* Host/device mode mismatch error interrupt */

#ifdef CONFIG_DEBUG_USB
      if ((regval & OTGHS_GINT_MMIS) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_MISMATCH),
                   (uint16_t)regval);
          stm32_putreg(OTGHS_GINT_MMIS, STM32_OTGHS_GINTSTS);
        }
#endif

      /* Resume/remote wakeup detected interrupt */

      if ((regval & OTGHS_GINT_WKUP) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_WAKEUP),
                   (uint16_t)regval);
          stm32_resumeinterrupt(priv);
          stm32_putreg(OTGHS_GINT_WKUP, STM32_OTGHS_GINTSTS);
        }

      /* USB suspend interrupt */

      if ((regval & OTGHS_GINT_USBSUSP) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_SUSPEND),
                   (uint16_t)regval);
          stm32_suspendinterrupt(priv);
          stm32_putreg(OTGHS_GINT_USBSUSP, STM32_OTGHS_GINTSTS);
        }

      /* Start of frame interrupt */

#ifdef CONFIG_USBDEV_SOFINTERRUPT
      if ((regval & OTGHS_GINT_SOF) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_SOF), (uint16_t)regval);
          stm32_putreg(OTGHS_GINT_SOF, STM32_OTGHS_GINTSTS);
        }
#endif

      /* RxFIFO non-empty interrupt.  Indicates that there is at least one
       * packet pending to be read from the RxFIFO.
       */

      if ((regval & OTGHS_GINT_RXFLVL) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_RXFIFO),
                   (uint16_t)regval);
          stm32_rxinterrupt(priv);
          stm32_putreg(OTGHS_GINT_RXFLVL, STM32_OTGHS_GINTSTS);
        }

      /* USB reset interrupt */

      if ((regval & OTGHS_GINT_USBRST) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_DEVRESET),
                   (uint16_t)regval);

          /* Perform the device reset */

          stm32_usbreset(priv);
          usbtrace(TRACE_INTEXIT(STM32_TRACEINTID_USB), 0);
          stm32_putreg(OTGHS_GINT_USBRST, STM32_OTGHS_GINTSTS);
          return OK;
        }

      /* Enumeration done interrupt */

      if ((regval & OTGHS_GINT_ENUMDNE) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_ENUMDNE),
                   (uint16_t)regval);
          stm32_enuminterrupt(priv);
          stm32_putreg(OTGHS_GINT_ENUMDNE, STM32_OTGHS_GINTSTS);
        }

      /* Incomplete isochronous IN transfer interrupt.  When the core finds
       * non-empty any of the isochronous IN endpoint FIFOs scheduled for
       * the current frame non-empty, the core generates an IISOIXFR
       * interrupt.
       */

#ifdef CONFIG_USBDEV_ISOCHRONOUS
      if ((regval & OTGHS_GINT_IISOIXFR) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_IISOIXFR),
                   (uint16_t)regval);
          stm32_isocininterrupt(priv);
          stm32_putreg(OTGHS_GINT_IISOIXFR, STM32_OTGHS_GINTSTS);
        }

      /* Incomplete isochronous OUT transfer.  For isochronous OUT
       * endpoints, the XFRC interrupt may not always be asserted. If the
       * core drops isochronous OUT data packets, the application could fail
       * to detect the XFRC interrupt.  The incomplete Isochronous OUT data
       * interrupt indicates that an XFRC interrupt was not asserted on at
       * least one of the isochronous OUT endpoints. At this point, the
       * endpoint with the incomplete transfer remains enabled, but no active
       * transfers remain in progress on this endpoint on the USB.
       */

      if ((regval & OTGHS_GINT_IISOOXFR) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_IISOOXFR),
                   (uint16_t)regval);
          stm32_isocoutinterrupt(priv);
          stm32_putreg(OTGHS_GINT_IISOOXFR, STM32_OTGHS_GINTSTS);
        }
#endif

      /* Session request/new session detected interrupt */

#ifdef CONFIG_USBDEV_VBUSSENSING
      if ((regval & OTGHS_GINT_SRQ) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_SRQ), (uint16_t)regval);
          stm32_sessioninterrupt(priv);
          stm32_putreg(OTGHS_GINT_SRQ, STM32_OTGHS_GINTSTS);
        }

      /* OTG interrupt */

      if ((regval & OTGHS_GINT_OTG) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_OTG), (uint16_t)regval);
          stm32_otginterrupt(priv);
          stm32_putreg(OTGHS_GINT_OTG, STM32_OTGHS_GINTSTS);
        }
#endif
    }

  usbtrace(TRACE_INTEXIT(STM32_TRACEINTID_USB), 0);
  return OK;
}

/****************************************************************************
 * Endpoint operations
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_enablegonak
 *
 * Description:
 *   Enable global OUT NAK mode
 *
 ****************************************************************************/

static void stm32_enablegonak(struct stm32_ep_s *privep)
{
  uint32_t regval;

