apache/nuttx/arch/arm/src/common/stm32/stm32_otghsdev_m3m4_v1.c
  /* First, make sure that there is no GNOAKEFF interrupt pending. */

#if 0
  stm32_putreg(OTGHS_GINT_GONAKEFF, STM32_OTGHS_GINTSTS);
#endif

  /* Enable Global OUT NAK mode in the core. */

  regval = stm32_getreg(STM32_OTGHS_DCTL);
  regval |= OTGHS_DCTL_SGONAK;
  stm32_putreg(regval, STM32_OTGHS_DCTL);

#if 0
  /* Wait for the GONAKEFF interrupt that indicates that the OUT NAK
   * mode is in effect.  When the interrupt handler pops the OUTNAK word
   * from the RxFIFO, the core sets the GONAKEFF interrupt.
   */

  while ((stm32_getreg(STM32_OTGHS_GINTSTS) & OTGHS_GINT_GONAKEFF) == 0);
  stm32_putreg(OTGHS_GINT_GONAKEFF, STM32_OTGHS_GINTSTS);

#else
  /* Since we are in the interrupt handler, we cannot wait inline for the
   * GONAKEFF because it cannot occur until service the RXFLVL global
   * interrupt and pop the OUTNAK word from the RxFIFO.
   *
   * Perhaps it is sufficient to wait for Global OUT NAK status to be
   * reported in OTGHS DCTL register?
   */

  while ((stm32_getreg(STM32_OTGHS_DCTL) & OTGHS_DCTL_GONSTS) == 0);
#endif
}

/****************************************************************************
 * Name: stm32_disablegonak
 *
 * Description:
 *   Disable global OUT NAK mode
 *
 ****************************************************************************/

static void stm32_disablegonak(struct stm32_ep_s *privep)
{
  uint32_t regval;

  /* Set the "Clear the Global OUT NAK bit" to disable global OUT NAK mode */

  regval  = stm32_getreg(STM32_OTGHS_DCTL);
  regval |= OTGHS_DCTL_CGONAK;
  stm32_putreg(regval, STM32_OTGHS_DCTL);
}

/****************************************************************************
 * Name: stm32_epout_configure
 *
 * Description:
 *   Configure an OUT endpoint, making it usable
 *
 * Input Parameters:
 *   privep    - a pointer to an internal endpoint structure
 *   eptype    - The type of the endpoint
 *   maxpacket - The max packet size of the endpoint
 *
 ****************************************************************************/

static int stm32_epout_configure(struct stm32_ep_s *privep,
                                 uint8_t eptype, uint16_t maxpacket)
{
  uint32_t mpsiz;
  uint32_t regaddr;
  uint32_t regval;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);

  /* For EP0, the packet size is encoded */

  if (privep->epphy == EP0)
    {
      DEBUGASSERT(eptype == USB_EP_ATTR_XFER_CONTROL);

      /* Map the size in bytes to the encoded value in the register */

      switch (maxpacket)
        {
          case 8:
            mpsiz = OTGHS_DOEPCTL0_MPSIZ_8;
            break;

          case 16:
            mpsiz = OTGHS_DOEPCTL0_MPSIZ_16;
            break;

          case 32:
            mpsiz = OTGHS_DOEPCTL0_MPSIZ_32;
            break;

          case 64:
            mpsiz = OTGHS_DOEPCTL0_MPSIZ_64;
            break;

          default:
            uerr("ERROR: Unsupported maxpacket: %d\n", maxpacket);
            return -EINVAL;
        }
    }

  /* For other endpoints, the packet size is in bytes */

  else
    {
      mpsiz = (maxpacket << OTGHS_DOEPCTL_MPSIZ_SHIFT);
    }

  /* If the endpoint is already active don't change the endpoint control
   * register.
   */

  regaddr = STM32_OTGHS_DOEPCTL(privep->epphy);
  regval  = stm32_getreg(regaddr);
  if ((regval & OTGHS_DOEPCTL_USBAEP) == 0)
    {
      if (regval & OTGHS_DOEPCTL_NAKSTS)
        {
          regval |= OTGHS_DOEPCTL_CNAK;
        }

      regval &= ~(OTGHS_DOEPCTL_MPSIZ_MASK | OTGHS_DOEPCTL_EPTYP_MASK);
      regval |= mpsiz;
      regval |= (eptype << OTGHS_DOEPCTL_EPTYP_SHIFT);
      regval |= (OTGHS_DOEPCTL_SD0PID | OTGHS_DOEPCTL_USBAEP);
      stm32_putreg(regval, regaddr);

      /* Save the endpoint configuration */

      privep->ep.maxpacket = maxpacket;
      privep->eptype       = eptype;
      privep->stalled      = false;
    }

  /* Enable the interrupt for this endpoint */

  regval = stm32_getreg(STM32_OTGHS_DAINTMSK);
  regval |= OTGHS_DAINT_OEP(privep->epphy);
  stm32_putreg(regval, STM32_OTGHS_DAINTMSK);
  return OK;
}

/****************************************************************************
 * Name: stm32_epin_configure
 *
 * Description:
 *   Configure an IN endpoint, making it usable
 *
 * Input Parameters:
 *   privep    - a pointer to an internal endpoint structure
 *   eptype    - The type of the endpoint
 *   maxpacket - The max packet size of the endpoint
 *
 ****************************************************************************/

static int stm32_epin_configure(struct stm32_ep_s *privep,
                                uint8_t eptype, uint16_t maxpacket)
{
  uint32_t mpsiz;
  uint32_t regaddr;
  uint32_t regval;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);

  /* For EP0, the packet size is encoded */

  if (privep->epphy == EP0)
    {
      DEBUGASSERT(eptype == USB_EP_ATTR_XFER_CONTROL);

      /* Map the size in bytes to the encoded value in the register */

      switch (maxpacket)
        {
          case 8:
            mpsiz = OTGHS_DIEPCTL0_MPSIZ_8;
            break;

          case 16:
            mpsiz = OTGHS_DIEPCTL0_MPSIZ_16;
            break;

          case 32:
            mpsiz = OTGHS_DIEPCTL0_MPSIZ_32;
            break;

          case 64:
            mpsiz = OTGHS_DIEPCTL0_MPSIZ_64;
            break;

          default:
            uerr("ERROR: Unsupported maxpacket: %d\n", maxpacket);
            return -EINVAL;
        }
    }

  /* For other endpoints, the packet size is in bytes */

  else
    {
      mpsiz = (maxpacket << OTGHS_DIEPCTL_MPSIZ_SHIFT);
    }

  /* If the endpoint is already active don't change the endpoint control
   * register.
   */

  regaddr = STM32_OTGHS_DIEPCTL(privep->epphy);
  regval  = stm32_getreg(regaddr);
  if ((regval & OTGHS_DIEPCTL_USBAEP) == 0)
    {
      if (regval & OTGHS_DIEPCTL_NAKSTS)
        {
          regval |= OTGHS_DIEPCTL_CNAK;
        }

      regval &= ~(OTGHS_DIEPCTL_MPSIZ_MASK |
                  OTGHS_DIEPCTL_EPTYP_MASK |
                  OTGHS_DIEPCTL_TXFNUM_MASK);
      regval |= mpsiz;
      regval |= (eptype << OTGHS_DIEPCTL_EPTYP_SHIFT);
      regval |= (privep->epphy << OTGHS_DIEPCTL_TXFNUM_SHIFT);
      regval |= (OTGHS_DIEPCTL_SD0PID | OTGHS_DIEPCTL_USBAEP);
      stm32_putreg(regval, regaddr);

      /* Save the endpoint configuration */

